# Типы данных в питоне
# 1. Nonetype - ничего, пустота -> None
# 2. Boolean - истина и ложь -> True/False
# 3. String - строки - str -> "hello World", 'Hello world'
# "My name is Johmn Snow!"
# 4. Числовые тиры данных
#   a) interger - целое число int -> -1, -2, 555
#   b) float - число с плавоющей точкой -> 1.5, 15.25
#   c) complex - 0j: 1, 5-9j
# 5) списковые типпы данных (колекция)
#   a) list(массив/список)-> [5,2, 4, True, "Hello"]
#   b) truple(кортеж) -> (1, 2, 3, None)
#   c) range(последовательность) -> range(1, 10)
# 6.set() - множество ->{1,2,3,4,5,6,7,8,}
# 7. dict(словари) -> содержат данные в себе в виде ключа и заначение {1: "one", 2: "two"}  


#----------------------------------------------------------------------------------------------



#  Mutable (изменяемые типы данных)
# 1. list
# 2. set
# 3. dict


# Immutuble(не изменямые ттиппы данных)
# None
# bool
# int, float, complex
# str
# turple, range
# frozenset

# ----------------------------------------------------------------------------------------------

# переменная - проимнованная оьласть памяти, предназанченная для хранаения данных. С её помощью мы можем проводить ращдичные операции с данными


num = 5
str1 = "Hello world"
'''
стандартный выывод данных

''' 
#  в питоне для вывода данных в терминал используется встроенная функция print()

stroka = "Hello world! my name is john Snow"

# print(stroka)
print(27 + 5)

'''
станадартный ввод данных через терминал
использутся функции input()

'''

# a = input("ведите число:")
# print(a)
# num = int(a)
# # print(num)
# # print(type(num))
# # print("данные в переменных:" a, num)
# print("в переменной а хранится:" , a, "ее тип данных", type (a))
# print("в переменной num хранится:", num, " ее тип данных", type(num))