# GIT - это распределеная система контроля версий 
# это система для отслеживания и ведения истории измениния файлов, в ващем проекте. 
# При поиощи распределености git еще и орнанизовывает командная работа 

#  Репозиторий - это хранилище вашего кода и истории его измениния

# GITHub - веб сайт для размещения git-репозитории в совместной разработке проектов 

# -------------------------------------------------------------------------------
# команда git:


# 1. git init - она создает ноавый локальный репозиториий,
# в той директории в которой была прописана команда. (Команда вводится один раз в начале)

# 2. git add - команда для добаления изменениий в систему отслеживания гита

# 3. git commit -m "<comment>" - команда для сохранения всех изменений в локальной репозитории с коментарием к ним 


# 4. git remote add <origin> <url> - это команда для того что бы связать ваш локальный репо с удаленным репо в гитхабе

# 5. git push <origin> <main> -  команда отправки вснх  ваших изменений на удаленный репо


# 1*) git init
#     2) git add
#     3) git commit -ma
# 4) git remote  add origin 
#     5) git push origin



